#+TITLE: A Linear Response, DFT+U Study of Trends in the Oxygen Evolution Activity of Transition Metal Rutile Dioxides
#+LATEX_CLASS: achemso
#+LATEX_CLASS_OPTIONS: [journal=jpccck,manuscript=letter,email=true]
# +latex_header: \setkeys{acs}{biblabel=brackets,super=true,articletitle=true}
#+latex_header: \setkeys{acs}{maxauthors=10}
#+latex_header: \setkeys{acs}{etalmode=truncate}
#+EXPORT_EXCLUDE_TAGS: noexport
#+OPTIONS: author:nil date:nil toc:nil num:t

#+latex_header: \usepackage[utf8]{inputenc}
#+latex_header: \usepackage{url}
#+latex_header: \usepackage{mhchem}
#+latex_header: \usepackage{graphicx}
#+latex_header: \usepackage{color}
#+latex_header: \usepackage{amsmath}
#+latex_header: \usepackage{textcomp}
#+latex_header: \usepackage{wasysym}
#+latex_header: \usepackage{latexsym}
#+latex_header: \usepackage{amssymb}
#+latex_header: \usepackage{lmodern}

#+latex_header: \usepackage[linktocpage, pdfstartview=FitH, colorlinks, linkcolor=black, anchorcolor=black, citecolor=black, filecolor=black, menucolor=black, urlcolor=black]{hyperref}

#+latex_header: \author{Zhongnan Xu}
#+latex_header: \affiliation{Department of Chemical Engineering, Carnegie Mellon University, 5000 Forbes Ave, Pittsburgh, PA 15213}
#+latex_header: \author{Jan Rossmeisl}
#+latex_header: \affiliation{Center for Atomic-Scale Materials Design, Department of Physics, Technical University of Denmark, Building 307, 2800 Kgs. Lyngby, Denmark}
#+latex_header: \author{John R. Kitchin}
#+latex_header: \email{jkitchin@andrew.cmu.edu}
#+latex_header: \affiliation{Department of Chemical Engineering, Carnegie Mellon University, 5000 Forbes Ave, Pittsburgh, PA 15213}

#+begin_abstract
** Preparation of the manuscript zip file
#+BEGIN_SRC sh
rm -f manuscript.zip
zip manuscript.zip figures/*.eps manuscript.tex figures/TOC.eps
#+END_SRC

#+RESULTS:
:   adding: figures/FIG1.eps (deflated 95%)
:   adding: figures/FIG2.eps (deflated 89%)
:   adding: figures/FIG3.eps (deflated 89%)
:   adding: figures/FIG4.eps (deflated 72%)
:   adding: figures/TOC.eps (deflated 24%)
:   adding: manuscript.tex (deflated 72%)

** Showing what changed

Copy old version into a file so we can latexdiff. It looks like we do not have a specific commit for the submission. We seem to have lost history. This commit is the closest I can get for this.

#+BEGIN_SRC sh
git show -s 0b8a36b
#+END_SRC

#+RESULTS:
: commit 0b8a36b570f33b3d3912d9e406de1f584e55d08b
: Author: Zhongnan Xu <zhongnanxu@cmu.edu>
: Date:   Mon Jan 26 13:26:40 2015 -0500
:
:     Initial commit after first submission

#+BEGIN_SRC sh
git show 0b8a36b:manuscript.org > initial-submission.org
#+END_SRC

This only approximately shows the differences, because it also uses the new references. Ideally, we should commit the tex file so we can rely on the real differences.
#+BEGIN_SRC emacs-lisp
(find-file "initial-submission.org")
(ox-manuscript-export-submission-manuscript)
#+END_SRC
#+RESULTS:
: initial-submission.tex

Now we run latexdiff old.tex new.tex

#+BEGIN_SRC sh :results silent
rm -f revisions.pdf
latexdiff initial-submission.tex manuscript.tex > revisions.tex
pdflatex -shell-escape -interaction nonstopmode revisions
pdflatex -shell-escape -interaction nonstopmode revisions
pdflatex -shell-escape -interaction nonstopmode revisions
#+END_SRC


#+BEGIN_SRC sh
open revisions.pdf
#+END_SRC

#+RESULTS:
